### Pandas Series and DF

In [31]:
#! pip install pandas

In [4]:
import pandas as pd

# Creating a Series from a list
data = [1, 2, 3, 4, 5]
s = pd.Series(data)
print(s)
print(type(s))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
import pandas as pd

# Creating a DataFrame from a dictionary
data = {'Name': ['John', 'Sara', 'Emily', 'David'],
        'Age': [25, 30, 35, 40],
        'Salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age  Salary
0   John   25   50000
1   Sara   30   60000
2  Emily   35   70000
3  David   40   80000
<class 'pandas.core.frame.DataFrame'>

### Pandas Operations

### 1. Indexing & Access to DF columns/rows

#### Example Snippet 1

In [32]:
# create a DataFrame with some example data
df = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie', 'David'],
                   'age': [25, 30, 35, 40],
                   'height': [5.5, 6.0, 5.8, 5.9]})
print(df)
df['name']
print(df.name)
print(df.loc[0])

      name  age  height
0    Alice   25     5.5
1      Bob   30     6.0
2  Charlie   35     5.8
3    David   40     5.9
0      Alice
1        Bob
2    Charlie
3      David
Name: name, dtype: object
name      Alice
age          25
height      5.5
Name: 0, dtype: object

#### Example Snippet2

In [42]:
import pandas as pd
# Create a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
        'Age': [25, 30, 35, 40, 45],
        'Country': ['USA', 'Canada', 'UK', 'Australia', 'USA'],
        'Salary': [50000, 60000, 70000, 80000, 90000]}
df = pd.DataFrame(data)
print(df)
# Select a single column
ages = df['Age']
print('Ages:')
print(ages)
# Select multiple columns
l = ['Name', 'Country']
name_and_country = df[l]
print('Name and Country:')
print(name_and_country)
# Select a single row by index label
row = df.loc[2]
print('Row 2:')
print(row)
# Select multiple rows by index labels
rows = df.loc[[1, 3, 4]]
print('Rows 1, 3, 4:')
print(rows)
# Select rows based on a condition
over_30 = df[df['Age'] > 30]
print('Over 30:')
print(over_30)
# Select rows and columns based on a condition
# high_salary = df.loc[df['Salary'] > 70000]
high_salary = df.loc[df['Salary'] > 70000, ['Name', 'Age', 'Country']]
print('High Salary:')
print(high_salary)

      Name  Age    Country  Salary
0    Alice   25        USA   50000
1      Bob   30     Canada   60000
2  Charlie   35         UK   70000
3    David   40  Australia   80000
4    Emily   45        USA   90000
Ages:
0    25
1    30
2    35
3    40
4    45
Name: Age, dtype: int64
Name and Country:
      Name    Country
0    Alice        USA
1      Bob     Canada
2  Charlie         UK
3    David  Australia
4    Emily        USA
Row 2:
Name       Charlie
Age             35
Country         UK
Salary       70000
Name: 2, dtype: object
Rows 1, 3, 4:
    Name  Age    Country  Salary
1    Bob   30     Canada   60000
3  David   40  Australia   80000
4  Emily   45        USA   90000
Over 30:
      Name  Age    Country  Salary
2  Charlie   35         UK   70000
3    David   40  Australia   80000
4    Emily   45        USA   90000
High Salary:
    Name  Age    Country
3  David   40  Australia
4  Emily   45        USA

### 2. Filtering DF

#### Example

In [43]:
import pandas as pd
# Create a DataFrame
df = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'gender': ['female', 'male', 'male', 'male']
})
# Filter the DataFrame to only include rows where age is greater than 30
filtered_df = df[df['age'] > 30]
print(filtered_df)

      name  age gender
2  Charlie   35   male
3    David   40   male

### 3. Aggregate Operation

#### Example

In [50]:
import pandas as pd

# create a DataFrame with some example data
df = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie', 'David', 'Alice', 'Bob'],
                   'age': [25, 30, 35, 40, 28, 32],
                   'salary': [50000, 60000, 70000, 80000, 55000, 65000]})

print(df)
# group the DataFrame by name and calculate the mean age and salary for each group
grouped_df = df.groupby('name').agg({'age': 'mean', 'salary': 'mean'})

print(grouped_df)

      name  age  salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000
4    Alice   28   55000
5      Bob   32   65000
          age   salary
name
Alice    26.5  52500.0
Bob      31.0  62500.0
Charlie  35.0  70000.0
David    40.0  80000.0

### 4. Addition/Modification to DF

#### Example

In [53]:
import pandas as pd
# Create a DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Salary': [50000, 60000, 70000]
})
# Add a new column to the DataFrame
df['Gender'] = ['F', 'M', 'M']
# Modify an existing column in the DataFrame
df['Salary'] = df['Salary'] * 1.05

# Add a new row to the DataFrame
# new_row = {'Name': 'David', 'Age': 40, 'Salary': 80000, 'Gender': 'M'}
# df = df.append(new_row, ignore_index=True)

# Modify a row in the DataFrame
df.loc[df['Name'] == 'Charlie', 'Age'] = 36
print(df)

      Name  Age   Salary Gender
0    Alice   25  52500.0      F
1      Bob   30  63000.0      M
2  Charlie   36  73500.0      M

### 5. Merging Data

#### Example 1: Merge DFs

In [1]:
import pandas as pd

# Create the first DataFrame
df1 = pd.DataFrame({
    'employee_id': ['1', '2', '3', '4'],
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'department_id': ['101', '102', '101', '103']
})

# Create the second DataFrame
df2 = pd.DataFrame({
    'department_id': ['101', '102', '103'],
    'department_name': ['Marketing', 'Sales', 'Finance']
})

print(df1)
print(df2)
# Merge the two DataFrames on the department_id column
merged_df = pd.merge(df1, df2, on='department_id')

#print(merged_df)
merged_df.head()

  employee_id     name department_id
0           1    Alice           101
1           2      Bob           102
2           3  Charlie           101
3           4    David           103
  department_id department_name
0           101       Marketing
1           102           Sales
2           103         Finance

  employee_id     name department_id department_name
0           1    Alice           101       Marketing
1           3  Charlie           101       Marketing
2           2      Bob           102           Sales
3           4    David           103         Finance

#### Example: Concat DFs w/o axis

In [57]:
import pandas as pd

# create first dataframe
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

# create second dataframe
df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']
})

# concatenate the dataframes vertically
# result = pd.concat([df1, df2], axis=0, ignore_index=True)
result = pd.concat([df1, df2])

# print the result
print(result)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

#### Example: Concat DFs with axis

In [58]:
import pandas as pd

# create two dataframes
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'C': [7, 8, 9], 'D': [10, 11, 12]})
print(df1)
print(df2)

   A  B
0  1  4
1  2  5
2  3  6
   C   D
0  7  10
1  8  11
2  9  12

In [59]:
# concatenate along the rows (axis=0)
df_row = pd.concat([df1, df2], axis=0)
print(df_row)

     A    B    C     D
0  1.0  4.0  NaN   NaN
1  2.0  5.0  NaN   NaN
2  3.0  6.0  NaN   NaN
0  NaN  NaN  7.0  10.0
1  NaN  NaN  8.0  11.0
2  NaN  NaN  9.0  12.0

In [60]:
# concatenate along the columns (axis=1)
df_col = pd.concat([df1, df2], axis=1)
print(df_col)

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

### Handling Missing Values

#### Example

In [61]:
import pandas as pd
import numpy as np

# create a DataFrame with some missing values
df = pd.DataFrame({'A': [1, 2, np.nan, 4],
                   'B': [5, np.nan, 7, 8],
                   'C': [9, 10, 11, np.nan]})

print(df)

# check which values are missing in the DataFrame
missing_values = df.isna()

# print the resulting boolean DataFrame
print(missing_values)

     A    B     C
0  1.0  5.0   9.0
1  2.0  NaN  10.0
2  NaN  7.0  11.0
3  4.0  8.0   NaN
       A      B      C
0  False  False  False
1  False   True  False
2   True  False  False
3  False  False   True

### Ways to Handle Missing Values

In [ ]:
#! pip install scikit-learn

In [9]:
#import scikit-learn as sklearn

In [11]:
import pandas as pd
import numpy as np

# create a DataFrame with missing values
df = pd.DataFrame({'A': [1, 2, np.nan, 4],
                   'B': [5, np.nan, np.nan, 8],
                   'C': [9, 10, 11, 12]})

print(df)
#drop rows with missing values
df = df.dropna(axis=0) #df.dropna()

#drop columns with missing values
df = df.dropna(axis=1)

#fill missing values with the mean of their respective columns
df = df.fillna(df.mean())
df.head()

# interpolate missing values
df = df.interpolate()
df.head()

# impute missing values using KNN imputation
# from sklearn.impute import KNNImputer
# imputer = KNNImputer(n_neighbors=2)
# df = pd.DataFrame(imputer.fit_transform(df), columns=df.columns)
# print(df)

     A    B   C
0  1.0  5.0   9
1  2.0  NaN  10
2  NaN  NaN  11
3  4.0  8.0  12

     A    B   C
0  1.0  5.0   9
3  4.0  8.0  12

### Descriptive Stats with Pandas

#### Summary

In [12]:
import pandas as pd
df = pd.read_csv('desc_stats.csv')

In [13]:
df

      Name  Gender  Age  Height  Weight
0    Alice  Female   25     170      65
1      Bob    Male   30     175      70
2  Charlie    Male   40     180      80
3     Dave    Male   35     185      90
4      Eve  Female   28     165      55

In [14]:
summary = df.describe()

In [15]:
summary

            Age      Height     Weight
count   5.00000    5.000000   5.000000
mean   31.60000  175.000000  72.000000
std     5.94138    7.905694  13.509256
min    25.00000  165.000000  55.000000
25%    28.00000  170.000000  65.000000
50%    30.00000  175.000000  70.000000
75%    35.00000  180.000000  80.000000
max    40.00000  185.000000  90.000000

#### Value Count

In [16]:
counts = df['Gender'].value_counts()

In [17]:
counts

Gender
Male      3
Female    2
Name: count, dtype: int64

#### Correlation

In [19]:
d = {
    "A": [1,2,3],
    "B": [4,5,6],
    "C": [2,2,4]
}

In [20]:
df = pd.DataFrame(d)

In [21]:
df

   A  B  C
0  1  4  2
1  2  5  2
2  3  6  4

In [22]:
df.corr()

          A         B         C
A  1.000000  1.000000  0.866025
B  1.000000  1.000000  0.866025
C  0.866025  0.866025  1.000000

#### Grouping

In [27]:
import pandas as pd
df = pd.read_csv('desc_stats.csv')
# grouped = df.groupby('Gender').mean()
# print(grouped)

In [28]:
df

      Name  Gender  Age  Height  Weight
0    Alice  Female   25     170      65
1      Bob    Male   30     175      70
2  Charlie    Male   40     180      80
3     Dave    Male   35     185      90
4      Eve  Female   28     165      55

In [32]:
df.groupby('Gender').agg({'Age': ['mean']})

         Age
        mean
Gender
Female  26.5
Male    35.0

In [31]:
agg = df.agg({'Age': ['mean', 'median'], 'Height': ['std', 'max'], 'Weight': 'sum'})
print(agg)

         Age      Height  Weight
mean    31.6         NaN     NaN
median  30.0         NaN     NaN
std      NaN    7.905694     NaN
max      NaN  185.000000     NaN
sum      NaN         NaN   360.0

### Pivot in Pandas

In [35]:
import pandas as pd

# Create a DataFrame with sales data
df = pd.DataFrame({
    'Month': ['Jan', 'Jan', 'Feb', 'Feb', 'Mar', 'Mar'],
    'Product': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Sales': [100, 200, 150, 250, 300, 400]
})

print(df)
# Pivot the DataFrame
pivot_df = df.pivot(index='Month', columns='Product', values='Sales')

print(pivot_df)

  Month Product  Sales
0   Jan       A    100
1   Jan       B    200
2   Feb       A    150
3   Feb       B    250
4   Mar       A    300
5   Mar       B    400
Product    A    B
Month
Feb      150  250
Jan      100  200
Mar      300  400